{
  "backend/main.mo": "Motoko actor that exposes a single public function returning a hardcoded canister ID string.",
  "feature_evidence.json": "Feature evidence report documenting three features related to replacing Barnali Chakraborty's profile image with cache-busting and draft deployment verification.",
  "frontend-file-summaries.txt": "Text file containing detailed summaries of all frontend source files including components, hooks, configuration, and styling.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for the design system.",
  "frontend/index.html": "HTML entry point that loads the React app with favicon, viewport meta tags, and references to the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that assembles the full page layout with Navigation, Hero, AboutUs, CoreTeam, Products, FarmerSupport, Contact, and Footer sections.",
  "frontend/src/components/AboutUs.tsx": "About section component displaying company story, team image, and four value cards highlighting women empowerment, quality, social impact, and natural goodness.",
  "frontend/src/components/Contact.tsx": "Contact section with three cards showing address, email addresses, and phone number with proper mailto/tel links and a call-to-action message.",
  "frontend/src/components/CoreTeam.tsx": "Core Team section displaying four team member profiles with aggressive cache-busting via timestamps, unique filenames, and useEffect DOM manipulation for founder, operations lead, and product lead images.",
  "frontend/src/components/DnsConfigurationGuide.tsx": "Component providing DNS configuration instructions (content truncated in source).",
  "frontend/src/components/FarmerSupport.tsx": "React component displaying Milletmist's farmer support program with impact cards showing direct partnership, sustainable income, training, and community building initiatives. Includes a hero section with farmer imagery and descriptive text about empowering ultra-poor farmers.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Raavni Agrobyte branding, copyright information, and attribution link to caffeine.ai. Includes company logo and dynamic year display.",
  "frontend/src/components/Hero.tsx": "Hero section component with full-screen background image, Raavni Agrobyte logo, headline text about health and impact, feature pills for natural millets/women-led/farmer support, and CTA buttons to explore products and learn about the story.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar with scroll detection, mobile menu toggle, and smooth scrolling to sections (home, about, team, products, farmer-support, contact). Highlights active section based on scroll position.",
  "frontend/src/components/Products.tsx": "Products showcase component displaying two millet-based products (Protein Bar and Energy Boost) with images, descriptions, and benefit badges. Includes a section highlighting general millet health and sustainability benefits.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an actor instance for backend communication, using Internet Identity for authentication. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Provides login, logout, and status tracking functionality with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Exports a React Query hook `useCanisterId` that fetches the canister ID from the actor when available and not currently fetching.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom warm earth-tone color palette (terracotta, sage, amber) for light and dark modes, custom fonts (Inter, Playfair Display), and gradient utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom OKLCH color system, typography plugins, custom animations (accordion, fade-in, slide-up), and responsive container settings.",
  "project_state.json": "Project metadata tracking three features for replacing Barnali Chakraborty's team profile image with cache-busting and draft deployment, including image processing requirements to match existing team photo dimensions (400x400)."
}