{
  "backend/main.mo": "Simple Motoko actor that exposes a single public function returning a hardcoded canister ID string.",
  "feature_evidence.json": "Feature evidence report documenting four features related to replacing and cache-busting the founder profile image in the CoreTeam component with high confidence.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend source files including components, hooks, and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI elements, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point for the Milletmist website with basic meta tags and a root div that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React application component that assembles all page sections (Navigation, Hero, AboutUs, CoreTeam, Products, FarmerSupport, Contact, Footer) with proper section IDs for navigation.",
  "frontend/src/components/AboutUs.tsx": "About section component showcasing Raavni Agrobyte's mission, story, team image, and four value cards highlighting women empowerment, quality, social impact, and natural goodness.",
  "frontend/src/components/Contact.tsx": "Contact section displaying three contact cards with address, email, and phone information, plus a call-to-action inviting visitors to join the Milletmist journey.",
  "frontend/src/components/CoreTeam.tsx": "Core Team section displaying four team member profiles with triple-layer cache-busting strategy (unique filename, timestamp query parameter, unique React key) specifically for the founder's image (barnali-ceo-v34.dim_400x400.png) to force fresh loads.",
  "frontend/src/components/DnsConfigurationGuide.tsx": "Component providing comprehensive DNS configuration guide with canister URL retrieval and step-by-step Cloudflare setup instructions (content truncated in source).",
  "frontend/src/components/FarmerSupport.tsx": "React component displaying Milletmist's farmer support initiatives with impact cards showing direct partnership, sustainable income, training, and community building benefits. Includes a hero section with farmer imagery and descriptive text about empowering ultra-poor farmers.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Raavni Agrobyte branding, copyright information, and attribution link to caffeine.ai. Includes company logo and dynamic year display.",
  "frontend/src/components/Hero.tsx": "Hero section component with full-screen background image, Raavni Agrobyte logo, headline text about health and impact, feature pills for natural millets/women-led/farmer support, and CTA buttons to explore products and story sections.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar with scroll-based styling, desktop and mobile menu support, smooth scrolling to sections (home, about, team, products, farmer-support, contact), and active section highlighting based on scroll position.",
  "frontend/src/components/Products.tsx": "Products showcase component displaying two millet-based products (Protein Bar and Energy Boost) with images, descriptions, and benefit badges, plus a section highlighting general millet health and sustainability benefits.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor instances based on Internet Identity authentication state, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options for ICP integration.",
  "frontend/src/hooks/useQueries.ts": "Exports a custom React Query hook `useCanisterId` that fetches the canister ID from the actor when available and not currently fetching.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a warm earth-toned color scheme (terracotta, sage, amber) supporting light/dark modes, custom fonts (Inter, Playfair Display), and gradient utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom OKLCH color system, typography plugins, custom animations (accordion, fade-in, slide-up), and responsive container settings.",
  "project_state.json": "Project metadata for Raavni Agrobyte/Milletmist website tracking features, known issues (logo display, button clicks, image caching), and architectural notes about the women-led millet products company."
}