{
  "backend/main.mo": "Empty Motoko actor with no functionality defined.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence fixes for Hero component scroll buttons (Explore Our Products and Our Story) targeting REQ-42 and REQ-43.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing the Raavni Agrobyte/Milletmist website components, styling, and structure.",
  "frontend/index.css": "Tailwind CSS base configuration with OKLCH color system defining light and dark theme CSS variables for the design system.",
  "frontend/index.html": "HTML entry point for the Milletmist website that loads the React app from main.tsx.",
  "frontend/src/App.tsx": "Main React application component that assembles Navigation, Hero, AboutUs, CoreTeam, Products, FarmerSupport, Contact, and Footer sections with proper IDs for navigation.",
  "frontend/src/components/AboutUs.tsx": "About section component showcasing Raavni Agrobyte's women-led mission, company story with team image, and four value cards highlighting empowerment, quality, social impact, and natural goodness.",
  "frontend/src/components/Contact.tsx": "Contact section displaying three info cards with address in Virar Maharashtra, email addresses, and phone number with proper mailto/tel links.",
  "frontend/src/components/CoreTeam.tsx": "Core Team section displaying four team member profile cards with images, names, roles, descriptions, and LinkedIn button placeholders in a responsive grid.",
  "frontend/src/components/FarmerSupport.tsx": "Farmer support section explaining Milletmist's ultra-poor farmer partnerships with farmer image and four impact cards covering direct partnership, sustainable income, training, and community building.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Raavni Agrobyte branding, copyright information, and attribution link to caffeine.ai with dynamic app identifier.",
  "frontend/src/components/Hero.tsx": "Hero section component with background image, logo, headline, feature pills (Natural Millets, Women-Led, Farmer Support), and CTA buttons for scrolling to products and about sections.",
  "frontend/src/components/Navigation.tsx": "Fixed navigation bar with logo, desktop/mobile menu, scroll-based styling, and smooth scrolling to sections (home, about, team, products, farmer-support, contact) with active section highlighting.",
  "frontend/src/components/Products.tsx": "Products section displaying two millet-based products (Protein Bar and Energy Boost) with images, descriptions, benefits badges, and a list of general millet health benefits.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor with authentication support, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks to interact with backend; currently empty with no implemented queries.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color scheme using warm earth tones (terracotta primary, sage secondary, amber accent), dark mode support, custom gradients, and typography settings.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH color space, typography (Inter/Playfair Display fonts), border radius variables, custom shadows, and animations for accordions and fade-in effects.",
  "project_state.json": "Project metadata for Raavni Agrobyte/Milletmist website tracking 9 implemented features (hero, about, products, farmer support, team sections, navigation, contact form, footer) with known issues including non-functional hero buttons and missing footer logo."
}