{
  "backend/main.mo": "Empty Motoko actor with no functionality implemented.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "JSON object containing summaries of all frontend component files, describing the Milletmist website structure including navigation, hero, about, team, products, farmer support, contact, and footer sections.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI elements, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point that loads the React application from main.tsx into a root div element.",
  "frontend/src/App.tsx": "Main React application component that assembles all page sections (Navigation, Hero, AboutUs, CoreTeam, Products, FarmerSupport, Contact, Footer) with proper section IDs for navigation.",
  "frontend/src/components/AboutUs.tsx": "About section component showcasing Raavni Agrobyte's women-led mission, company story with team image, and four value cards highlighting women empowerment, quality, social impact, and natural goodness.",
  "frontend/src/components/Contact.tsx": "Contact section displaying three contact information cards (location, email, phone) with icons and a call-to-action message inviting visitors to join the Milletmist journey.",
  "frontend/src/components/CoreTeam.tsx": "Team section displaying four team member profile cards with images, names, roles, descriptions, and LinkedIn button placeholders in a responsive grid layout.",
  "frontend/src/components/FarmerSupport.tsx": "Farmer support section with farmer image and four impact cards explaining direct partnership, sustainable income, training support, and community building initiatives for ultra-poor millet farmers.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Milletmist logo, company branding, copyright notice, and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Hero.tsx": "Hero section component with background image, logo, heading, tagline, feature pills (Natural Millets, Women-Led, Farmer Support), and CTA buttons that scroll to products and about sections.",
  "frontend/src/components/Navigation.tsx": "Fixed navigation bar component with logo, desktop/mobile menus, scroll-based styling changes, active section highlighting, and smooth scrolling to page sections.",
  "frontend/src/components/Products.tsx": "Products section displaying two millet-based products (Protein Bar and Energy Boost) with images, descriptions, benefits badges, and a list of general millet health benefits.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor, handling both authenticated and anonymous states, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity storage, and providing login/logout functionality with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks to interact with the backend; currently empty with no implemented queries.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earth-tone color palette (terracotta, sage, amber) for light and dark modes, plus custom gradient utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH color variables, custom fonts (Inter, Playfair Display), extended border radius, shadows, and animations for accordions and fade-in effects. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state file documenting a website for Raavni Agrobyte's Milletmist brand, tracking 8 implemented features including hero section, about us, products showcase, farmer support, team section, contact form, responsive navigation, and earthy visual design with millet/women empowerment themes."
}