{
  "backend/main.mo": "Motoko actor with a single public function that returns a hardcoded canister ID string.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features for removing DNS Setup menu items and references from the Navigation component.",
  "frontend-file-summaries.txt": "Text file containing detailed summaries of all frontend component files including Navigation, Hero, AboutUs, Products, Contact, and other React components with their functionality and styling details.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using OKLCH color space for backgrounds, foregrounds, borders, and component styling.",
  "frontend/index.html": "HTML entry point for the Milletmist website with basic meta tags and a root div that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React application component that assembles the full page layout with Navigation and seven main sections (Hero, AboutUs, CoreTeam, Products, FarmerSupport, Contact, Footer) wrapped in semantic HTML.",
  "frontend/src/components/AboutUs.tsx": "About section component displaying company information, mission statement, team image, and four value cards highlighting women empowerment, quality, social impact, and natural goodness.",
  "frontend/src/components/Contact.tsx": "Contact section component with three cards displaying address, email addresses, and phone number with interactive mailto/tel links and hover effects.",
  "frontend/src/components/CoreTeam.tsx": "Core team section displaying four team member profile cards with images (including cache-busting for Barnali's photo), names, roles, descriptions, and LinkedIn button placeholders in a responsive grid.",
  "frontend/src/components/DnsConfigurationGuide.tsx": "Component for displaying DNS configuration instructions (file content truncated in input).",
  "frontend/src/components/FarmerSupport.tsx": "React component displaying Milletmist's farmer support program with impact cards showing direct partnership, sustainable income, training, and community building initiatives. Includes a hero section with farmer imagery and detailed text about empowering ultra-poor farmers.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Raavni Agrobyte branding, copyright information, and attribution link to caffeine.ai. Includes company logo and dynamic year display.",
  "frontend/src/components/Hero.tsx": "Hero section component with full-screen background image, animated logo, headline text emphasizing health and impact, feature pills for natural millets/women-led/farmer support, and CTA buttons to explore products or learn about the story.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar with scroll-based styling, mobile menu toggle, and smooth scrolling to page sections (home, about, team, products, farmer-support, contact). Includes active section highlighting and responsive design.",
  "frontend/src/components/Products.tsx": "Products showcase component displaying two millet-based products (Protein Bar and Energy Boost) with images, descriptions, benefit badges, and a separate section listing general millet health benefits.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor instance using React Query, handling both authenticated and anonymous actors based on Internet Identity state. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle. Provides status tracking (initializing, idle, logging-in, success, error) and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Exports a React Query hook `useCanisterId` that fetches the canister ID from the actor when available and not currently fetching.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a warm earth-tone color scheme (terracotta, sage, amber) supporting light and dark modes, plus custom gradient utilities and typography settings using Inter and Playfair Display fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and wraps the App component with InternetIdentityProvider and QueryClientProvider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom OKLCH color system, typography plugins, custom animations (accordion, fade-in, slide-up), and responsive container settings.",
  "project_state.json": "Project metadata for Raavni Agrobyte/Milletmist website tracking architectural notes, existing features, and known issues including non-functional hero buttons, logo display problems, and incorrect founder image rendering."
}