{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting four completed features: fixing hero section typography animation, replacing founder profile image with barnali.jpeg, changing founder name to Barnali Chakraborty, and updating founder experience from 15+ to 10 years.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the complete Milletmist website structure including navigation, hero section with animations, about section, core team profiles, products showcase, farmer support, contact info, and styling configuration.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color system variables for light and dark themes with warm earth tones (terracotta, sage green, amber) and sidebar configurations.",
  "frontend/index.html": "HTML entry point for the Milletmist website with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component that assembles all page sections (Navigation, Hero, AboutUs, CoreTeam, Products, FarmerSupport, Contact, Footer) with proper section IDs for navigation.",
  "frontend/src/components/AboutUs.tsx": "About section component displaying Raavni Agrobyte's story, women-led mission, team image, and four value cards highlighting women empowerment, quality excellence, social impact, and natural goodness.",
  "frontend/src/components/Contact.tsx": "Contact section with three info cards showing address in Virar Maharashtra, email addresses (connect@raavni.com, barnali@raavni.com), phone number, and call-to-action message with proper mailto/tel links.",
  "frontend/src/components/CoreTeam.tsx": "Core Team section displaying four team member profiles in a grid, including founder Barnali Chakraborty with barnali-founder.dim_400x400.png image and 10 years experience, plus three other team members with images, roles, descriptions, and LinkedIn placeholders.",
  "frontend/src/components/FarmerSupport.tsx": "React component displaying Milletmist's farmer support initiatives with impact cards showing direct partnership, sustainable income, training, and community building benefits. Includes a hero section with farmer imagery and descriptive text about empowering ultra-poor farmers.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Raavni Agrobyte branding, copyright information, and attribution link to caffeine.ai. Includes logo, company name, and dynamic year display.",
  "frontend/src/components/Hero.tsx": "Hero section component with full-screen background image, Raavni Agrobyte logo, main heading about health and impact, feature pills (Natural Millets, Women-Led, Farmer Support), and CTA buttons for exploring products and learning about the company story.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar component with scroll-based styling, mobile menu toggle, and smooth scrolling to page sections (Home, About, Team, Products, Farmer Support, Contact). Tracks active section based on scroll position.",
  "frontend/src/components/Products.tsx": "Products showcase component displaying Milletmist Protein Bar and Energy Boost products with images, descriptions, benefit badges, and a dedicated section highlighting millet health and sustainability benefits.",
  "frontend/src/hooks/useActor.ts": "React Query hook for managing backend actor instances with Internet Identity authentication. Creates anonymous or authenticated actors based on identity state and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle. Provides login status tracking and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for React Query hooks to interact with the backend; currently empty as no backend functionality is implemented yet.",
  "frontend/src/index.css": "Global CSS file defining Tailwind configuration with custom warm earth-tone color palette (terracotta, sage green, amber), typography using Inter and Playfair Display fonts, and custom gradient utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for React Query and InternetIdentityProvider for authentication.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH color system, typography plugins, container queries, custom animations (accordion, fade-in, slide-up), and warm/sage box shadows.",
  "project_state.json": "Project metadata tracking the Raavni Agrobyte/Milletmist website state, including implemented features (hero, about, products, farmer support sections), known issues (logo display, button clicks, typography animation), and image requirements for founder profile."
}