{
  "backend/main.mo": "Motoko actor that exposes a single public function getCanisterId() returning a hardcoded canister ID string.",
  "feature_evidence.json": "Feature evidence report documenting the DNS configuration guide feature with high confidence, listing related frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend source files including components, hooks, and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining design tokens for colors, borders, and UI elements.",
  "frontend/index.html": "HTML entry point for the Milletmist website with basic meta tags and a root div that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React application component that renders the complete website structure with Navigation and seven main sections (Hero, AboutUs, CoreTeam, Products, FarmerSupport, Contact, DnsConfigurationGuide) plus Footer.",
  "frontend/src/components/AboutUs.tsx": "About section component showcasing Raavni Agrobyte's mission as a women-led millet products company, featuring company story, team image, and four value cards highlighting empowerment, quality, impact, and natural ingredients.",
  "frontend/src/components/Contact.tsx": "Contact section displaying three contact cards with address, email, and phone information for Raavni Agrobyte, including clickable mailto and tel links.",
  "frontend/src/components/CoreTeam.tsx": "Core team section displaying four team member profile cards with images, names, roles, descriptions, and LinkedIn button placeholders in a responsive grid layout.",
  "frontend/src/components/DnsConfigurationGuide.tsx": "React component that displays a step-by-step guide for configuring DNS to connect a custom domain to an Internet Computer canister, including Cloudflare setup instructions and copy-to-clipboard functionality for canister URLs.",
  "frontend/src/components/FarmerSupport.tsx": "React component showcasing Milletmist's commitment to supporting ultra-poor millet farmers through direct partnerships, fair pricing, training, and community building, with impact cards and descriptive content.",
  "frontend/src/components/Footer.tsx": "React component rendering the site footer with Raavni Agrobyte branding, copyright information, and attribution to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Hero.tsx": "React component displaying the landing page hero section with animated logo, headline, feature pills, CTA buttons, and a background image with gradient overlay for Raavni Agrobyte's millet products.",
  "frontend/src/components/Navigation.tsx": "React component implementing a sticky navigation bar with smooth scrolling to sections, active section highlighting, mobile menu toggle, and logo that adapts styling based on scroll position.",
  "frontend/src/components/Products.tsx": "React component showcasing Milletmist product offerings (protein bars and energy products) with images, benefits badges, and a section highlighting the nutritional and sustainability benefits of millets.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages Internet Computer actor creation using React Query, handling both authenticated and anonymous actors, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hook that fetches the canister ID from the actor instance when available.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a warm earth-tone color palette (terracotta, sage, amber) for light/dark modes, custom gradients, and typography using Inter and Playfair Display fonts.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom OKLCH color system, typography plugins, custom shadows, border radius variables, and animation keyframes for accordions and fade effects.",
  "project_state.json": "Project metadata for Raavni Agrobyte/Milletmist website tracking architectural notes, existing features, and known issues including non-functional hero buttons, logo display problems, and incorrect founder image rendering."
}