{
  "backend/main.mo": "Empty Motoko actor with no functionality implemented.",
  "feature_evidence.json": "Feature evidence report documenting two completed features related to replacing Barnali Chakraborty's founder profile image with BarnaliC.png at 400x400 dimensions in the CoreTeam component.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the complete Milletmist website structure including navigation, hero section with logo and animations, about section, core team profiles, products, farmer support, contact info, and styling configuration.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color system variables for light and dark themes with warm earth tones (terracotta, sage, amber) and sidebar configurations.",
  "frontend/index.html": "HTML entry point for the Milletmist website that loads the React application from main.tsx into the root div.",
  "frontend/src/App.tsx": "Main React application component that renders the complete website structure with Navigation, Hero, AboutUs, CoreTeam, Products, FarmerSupport, Contact, and Footer sections wrapped in semantic HTML sections with IDs for navigation.",
  "frontend/src/components/AboutUs.tsx": "About section component displaying Raavni Agrobyte's story as a women-led organization with team image, company narrative, and four value cards highlighting women empowerment, quality excellence, social impact, and natural goodness.",
  "frontend/src/components/Contact.tsx": "Contact section component displaying three contact cards with address in Virar Maharashtra, email addresses (connect@raavni.com, barnali@raavni.com), phone number, and a call-to-action message inviting visitors to join the Milletmist journey.",
  "frontend/src/components/CoreTeam.tsx": "Core Team section displaying four team member profile cards including founder Barnali Chakraborty with BarnaliC.dim_400x400.png image (with cache-busting query parameter), along with three other team members, all showing images, names, roles, descriptions, and LinkedIn button placeholders in a responsive grid.",
  "frontend/src/components/FarmerSupport.tsx": "React component displaying Milletmist's farmer support program with impact cards showing direct partnership, sustainable income, training, and community building initiatives. Includes hero section with farmer image and detailed description of ultra-poor farmer empowerment.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Raavni Agrobyte branding, copyright information, and attribution link to caffeine.ai. Includes company logo and dynamic year display.",
  "frontend/src/components/Hero.tsx": "Hero section component with full-screen background image, Raavni Agrobyte logo, main heading about health and impact, feature pills for natural millets/women-led/farmer support, and CTA buttons to explore products and story.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar with scroll detection, active section highlighting, and responsive mobile menu. Includes smooth scrolling to sections (home, about, team, products, farmer-support, contact) and logo with brand name.",
  "frontend/src/components/Products.tsx": "Products showcase component displaying two millet-based products (Protein Bar and Energy Boost) with images, descriptions, and benefit badges. Includes a millet benefits section highlighting nutritional and sustainability advantages.",
  "frontend/src/hooks/useActor.ts": "React Query hook for managing backend actor instances with Internet Identity authentication. Creates authenticated or anonymous actors based on identity state and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication on ICP, providing login/logout functionality, identity state management, and authentication status tracking. Includes AuthClient creation with configurable options and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for React Query hooks to interact with the backend; currently empty with no queries implemented.",
  "frontend/src/index.css": "Global CSS with Tailwind configuration, custom CSS variables for warm earth-tone color scheme (terracotta, sage, amber), dark mode support, and custom gradient utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors using OKLCH color space, typography plugins, custom animations (accordion, fade-in, slide-up), and warm/sage shadow utilities.",
  "project_state.json": "Project state tracking document for Raavni Agrobyte/Milletmist website with known issues including non-functional hero buttons, logo display problems, team member updates needed, and founder image caching/replacement issues."
}