{
  "backend/main.mo": "Simple Motoko actor that exposes a single public function returning a hardcoded canister ID string.",
  "feature_evidence.json": "Feature evidence report documenting four features related to replacing the founder profile image with aggressive cache-busting strategies including v43 versioning, unique filenames, and multiple cache-control mechanisms.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including Navigation, Hero, AboutUs, CoreTeam, Products, FarmerSupport, Contact, Footer, and configuration files with detailed descriptions of their functionality and styling.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color system for light and dark themes, including primary, secondary, accent colors and sidebar styling.",
  "frontend/index.html": "Basic HTML entry point for the Milletmist website with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component that assembles all page sections (Navigation, Hero, AboutUs, CoreTeam, Products, FarmerSupport, Contact, Footer) with proper section IDs for navigation.",
  "frontend/src/components/AboutUs.tsx": "About section component displaying Raavni Agrobyte's mission, story with team image, and four value cards highlighting women empowerment, quality, social impact, and natural goodness.",
  "frontend/src/components/Contact.tsx": "Contact section with three cards displaying address, email addresses, and phone number with proper mailto/tel links, plus a call-to-action message.",
  "frontend/src/components/CoreTeam.tsx": "Core Team section displaying four team member profiles with the founder's image using aggressive cache-busting (v43 filename, timestamp query parameter, unique React key, DOM manipulation via useEffect, and cache-control attributes).",
  "frontend/src/components/DnsConfigurationGuide.tsx": "Component providing comprehensive DNS configuration instructions for Cloudflare setup, displaying canister URL from backend.",
  "frontend/src/components/FarmerSupport.tsx": "React component displaying Milletmist's farmer support program with impact cards showing direct partnership, sustainable income, training, and community building initiatives. Includes a hero image and detailed text about empowering ultra-poor millet farmers.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Raavni Agrobyte branding, copyright information, and attribution link to caffeine.ai. Includes company logo and dynamic year display.",
  "frontend/src/components/Hero.tsx": "Hero section component with full-screen background image, Raavni Agrobyte logo, headline text about health and impact, feature pills for natural millets/women-led/farmer support, and CTA buttons to explore products or learn about the story.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar with scroll-based styling, desktop and mobile menu support, smooth scrolling to sections (home, about, team, products, farmer-support, contact), and active section highlighting based on scroll position.",
  "frontend/src/components/Products.tsx": "Products showcase component displaying Milletmist Protein Bar and Energy Boost products with images, descriptions, benefit badges, and a section highlighting general millet health and sustainability benefits.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor instance based on Internet Identity authentication state, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options for ICP integration.",
  "frontend/src/hooks/useQueries.ts": "Exports a React Query hook `useCanisterId` that fetches the canister ID from the actor when available.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a warm earth-tone color scheme (terracotta, sage, amber) supporting light and dark modes, plus custom gradient utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors using OKLCH color space, custom fonts (Inter, Playfair Display), border radii, shadows, and keyframe animations.",
  "project_state.json": "Project metadata for Raavni Agrobyte/Milletmist website tracking features, known issues (logo display, button clicks, deployment failures, image caching), and architectural notes about the food/nutrition company's brand focus."
}