{
  "backend/main.mo": "Empty Motoko actor file serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two completed hero section text changes: tagline replacement to 'Built for Health, Designed for Impact' in black, and description update to 'Premium Millet Based products...' in bold white.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend component files describing the Milletmist website structure including Navigation, Hero, AboutUs, CoreTeam, Products, FarmerSupport, Contact, and Footer components with their specific content and styling details.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color system for light and dark modes, including warm earth tones and sidebar theming.",
  "frontend/index.html": "HTML entry point for the Milletmist website with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component that assembles all page sections (Navigation, Hero, AboutUs, CoreTeam, Products, FarmerSupport, Contact, Footer) with proper section IDs for navigation.",
  "frontend/src/components/AboutUs.tsx": "About section component showcasing Raavni Agrobyte's story, women-led mission, team image, and four value cards highlighting women empowerment, quality excellence, social impact, and natural goodness.",
  "frontend/src/components/Contact.tsx": "Contact section displaying three contact cards with address (Virar, Maharashtra), email addresses (connect@raavni.com, barnali@raavni.com), phone number, and a call-to-action message inviting visitors to join the Milletmist journey.",
  "frontend/src/components/CoreTeam.tsx": "Core Team section displaying four team member profile cards with images, names, roles, descriptions, and LinkedIn button placeholders in a responsive grid layout.",
  "frontend/src/components/FarmerSupport.tsx": "React component displaying Milletmist's farmer support program with sections for empowerment messaging, impact areas (direct partnership, sustainable income, training, community building), and an image of farmers with millet grains.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Raavni Agrobyte branding, copyright information, and attribution link to caffeine.ai with dynamic app identifier based on hostname.",
  "frontend/src/components/Hero.tsx": "Hero section component with full-screen background image, Raavni Agrobyte logo, headline about health and impact, feature pills (natural millets, women-led, farmer support), and CTA buttons to explore products and learn about the company.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar with logo, desktop/mobile menu, smooth scrolling to sections (home, about, team, products, farmer-support, contact), active section highlighting, and scroll-based background transparency.",
  "frontend/src/components/Products.tsx": "Products showcase component displaying two millet-based products (Protein Bar and Energy Boost) with images, descriptions, benefit badges, and a section highlighting general millet health and sustainability benefits.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing AuthClient creation, login/logout flows, identity persistence, and authentication status states (initializing, idle, logging-in, success, error).",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for React Query hooks to interact with the backend; currently empty as no backend functionality is implemented yet.",
  "frontend/src/index.css": "Global CSS file defining Tailwind base styles with custom CSS variables for a warm earth-tone color scheme (terracotta, sage green, amber) supporting light and dark modes, plus custom gradient utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors using OKLCH color space, typography settings (Inter and Playfair Display fonts), custom shadows, animations, and plugins for typography and container queries.",
  "project_state.json": "Project state file documenting the Raavni Agrobyte/Milletmist website features, including hero section, about us, products showcase, farmer support, team section, and contact form, with a known issue regarding the Raavni Agrobyte logo not appearing in the footer."
}