{
  "backend/main.mo": "Simple Motoko actor that exposes a single public function returning a hardcoded canister ID string.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend React components, hooks, and configuration files describing the Milletmist website structure, styling, and functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI elements, charts, and sidebar components.",
  "frontend/index.html": "Basic HTML entry point for the Milletmist website that loads the React app from main.tsx into a root div.",
  "frontend/src/App.tsx": "Main React application component that assembles the complete website layout with Navigation, Hero, AboutUs, CoreTeam, Products, FarmerSupport, Contact, and Footer sections wrapped in semantic HTML with section IDs.",
  "frontend/src/components/AboutUs.tsx": "About section component showcasing Raavni Agrobyte's mission as a women-led millet products company with team imagery, company story, and four value cards highlighting empowerment, quality, social impact, and natural ingredients.",
  "frontend/src/components/Contact.tsx": "Contact section displaying three information cards with address, email addresses, and phone number, plus a call-to-action encouraging visitors to join the Milletmist journey.",
  "frontend/src/components/CoreTeam.tsx": "Core team section displaying four team member profile cards with images (including cache-busted Barnali Chakraborty photo), names, roles, descriptions, and LinkedIn link placeholders in a responsive grid.",
  "frontend/src/components/DnsConfigurationGuide.tsx": "Empty/truncated component file for DNS configuration guidance.",
  "frontend/src/components/FarmerSupport.tsx": "Farmer support initiative section explaining Milletmist's direct partnerships with ultra-poor millet farmers, featuring imagery and four impact cards detailing partnership benefits, sustainable income, training, and community building.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Raavni Agrobyte branding, copyright notice, and attribution link to caffeine.ai with dynamic app identifier.",
  "frontend/src/components/Hero.tsx": "Hero section component with background image, animated heading, feature pills (Natural Millets, Women-Led, Farmer Support), and CTA buttons that scroll to products and about sections.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation bar with logo, desktop/mobile menus, scroll-based styling, and smooth scrolling to sections (home, about, team, products, farmer-support, contact, dns-guide).",
  "frontend/src/components/Products.tsx": "Products showcase component displaying two millet-based products (Protein Bar and Energy Boost) with images, benefits badges, and a section listing general millet health benefits.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor instance based on Internet Identity authentication state, invalidating dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hook that fetches the canister ID from the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining warm earth-tone color palette (terracotta, sage, amber) for light/dark modes, custom gradients, and typography settings.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens using OKLCH color space, typography plugins, custom animations (accordion, fade-in, slide-up), extended border radius, shadows, and font families (Inter, Playfair Display).",
  "project_state.json": "Project state tracking for Raavni Agrobyte/Milletmist website at version 53, documenting features (hero section, about us, products, farmer support), known issues (logo display, button clicks, team member updates, image caching), and architectural notes about the women-led sustainable food brand."
}