{
  "backend/main.mo": "Main backend actor that exposes a single public function getCanisterId() returning a hardcoded canister ID string.",
  "feature_evidence.json": "Feature evidence report documenting two features related to replacing the founder profile image with barnaliprofressional.png at 400x400 dimensions in the CoreTeam component.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of frontend component files, describing navigation, hero, team, products, contact sections and their functionality.",
  "frontend/index.css": "Global CSS file defining Tailwind base styles with OKLCH color system variables for light and dark themes, including sidebar, chart, and UI component color tokens.",
  "frontend/index.html": "HTML entry point for the Milletmist website with basic meta tags, title, root div, and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component that assembles the full page layout with Navigation and seven main sections (Hero, AboutUs, CoreTeam, Products, FarmerSupport, Contact, Footer) wrapped in semantic HTML.",
  "frontend/src/components/AboutUs.tsx": "About section component displaying company description, team image, story narrative, and four value cards highlighting women empowerment, quality, social impact, and natural goodness.",
  "frontend/src/components/Contact.tsx": "Contact section component with three cards showing address, email, and phone information with interactive links, plus a call-to-action message inviting visitors to join the Milletmist journey.",
  "frontend/src/components/CoreTeam.tsx": "Core Team section displaying four team member profile cards with images (including cache-busted barnaliprofressional.png for founder), names, roles, descriptions, and LinkedIn button placeholders in a responsive grid.",
  "frontend/src/components/DnsConfigurationGuide.tsx": "Component providing DNS configuration instructions for Cloudflare setup with canister URL retrieval and CNAME record guidance (content truncated in source).",
  "frontend/src/components/FarmerSupport.tsx": "React component displaying Milletmist's farmer support program with impact cards showing direct partnership, sustainable income, training, and community building initiatives. Includes hero section with farmer image and detailed description of ultra-poor farmer empowerment.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Raavni Agrobyte branding, copyright information, and attribution link to caffeine.ai. Includes logo, company name, and dynamic year display.",
  "frontend/src/components/Hero.tsx": "Hero section component with full-screen background image, Raavni Agrobyte logo, headline emphasizing health and impact, feature pills for natural millets/women-led/farmer support, and CTA buttons to explore products and story. Includes smooth scroll navigation.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar with logo, desktop/mobile menu, scroll-based styling changes, and active section highlighting. Provides smooth scrolling to sections: home, about, team, products, farmer-support, and contact.",
  "frontend/src/components/Products.tsx": "Products showcase component displaying Milletmist Protein Bar and Energy Boost with images, descriptions, benefit badges, and a dedicated section listing health and sustainability benefits of millets.",
  "frontend/src/hooks/useActor.ts": "React hook managing backend actor creation with Internet Identity authentication, using React Query for caching and automatic query invalidation when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options for ICP integration.",
  "frontend/src/hooks/useQueries.ts": "Exports a React Query hook `useCanisterId` that fetches the canister ID from the actor when available and not currently fetching.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom warm earth-tone color palette (terracotta, sage green, amber) for light and dark modes, custom fonts (Inter, Playfair Display), and gradient utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom OKLCH color system, typography plugins, custom fonts, border radius variables, shadows, and keyframe animations for accordions and fade effects.",
  "project_state.json": "Project state document for Raavni Agrobyte/Milletmist website tracking features, known issues (logo display, button clicks, typography animation), and architectural notes about the women-led millet protein bar company."
}