{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Locate canister ID and provide DNS configuration instructions for raavni.com",
  "requirements": [
    {
      "id": "REQ-62",
      "summary": "Generate a comprehensive DNS configuration guide document that includes the canister URL, Cloudflare DNS setup instructions with CNAME records, SSL certificate configuration, and DNS verification steps",
      "acceptanceCriteria": [
        "A complete DNS configuration guide is generated with the actual canister URL populated",
        "Cloudflare-specific CNAME record configuration steps are provided with exact values (Name: @, Value: [canister-id].ic0.app, Proxy status: enabled)",
        "SSL/TLS configuration instructions specify the recommended mode (Full or Full (strict))",
        "Guide includes DNS propagation timeline (24-48 hours) and verification steps",
        "Instructions are clear, actionable, and suitable for users without deep technical expertise"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DnsConfigurationGuide.tsx",
          "operation": "create",
          "description": "Create a comprehensive DNS configuration guide component that displays the canister URL retrieved from the backend getCanisterId() method, provides step-by-step Cloudflare DNS setup instructions with specific CNAME record values (Name: @, Value: [canister-id].ic0.app, Proxy: enabled), includes SSL/TLS configuration guidance recommending Full or Full (strict) mode, shows DNS propagation timeline (24-48 hours), and provides verification steps. Use the useActor hook to call the backend getCanisterId() method and format the canister URL as https://[canister-id].ic0.app. Style with Tailwind classes matching the existing warm earth-tone design system."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import and add the DnsConfigurationGuide component as a new section in the application layout, positioned after the Contact section and before the Footer. Add an ID attribute for navigation purposes (id=\"dns-guide\"). Ensure the section follows the same semantic HTML structure as other sections."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Add a new navigation link for the DNS Configuration Guide section to the navigation menu. Include it in both desktop and mobile navigation menus with appropriate smooth scrolling behavior to the #dns-guide anchor. Update the active section highlighting logic to include the new section."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query hook useCanisterId() that calls the backend getCanisterId() method using the useActor hook. Return the query result with proper loading, error, and data states. This hook will be consumed by the DnsConfigurationGuide component to retrieve and display the canister ID."
        }
      ]
    }
  ]
}